kendryte/arduino-k210/cores/k210/components/fatfs/vfs_fat.c
    _lock_acquire(&fat_ctx->lock);
    file = &fat_ctx->files[fd];
    if (file == NULL) {
        LOG_D("ftruncate NULL file pointer");
        errno = EINVAL;
        ret = -1;
        goto out;
    }

    long sz = f_size(file);
    if (sz < length) {
        LOG_D("ftruncate does not support extending size");
        errno = EPERM;
        ret = -1;
        goto out;
    }

    res = f_lseek(file, length);
    if (res != FR_OK) {
        LOG_D("%s: fresult=%d", __func__, res);
        errno = fresult_to_errno(res);
        ret = -1;
        goto out;
    }

    res = f_truncate(file);

    if (res != FR_OK) {
        LOG_D("%s: fresult=%d", __func__, res);
        errno = fresult_to_errno(res);
        ret = -1;
    }

out:
    _lock_release(&fat_ctx->lock);
    return ret;
}

static int vfs_fat_utime(void *ctx, const char *path, const struct utimbuf *times)
{
    FILINFO filinfo_time;

    {
        struct tm tm_time;

        if (times) {
            localtime_r(&times->modtime, &tm_time);
        } else {
            // use current time
            struct timeval tv;
            gettimeofday(&tv, NULL);
            localtime_r(&tv.tv_sec, &tm_time);
        }

        if (tm_time.tm_year < 80) {
            // FATFS cannot handle years before 1980
            errno = EINVAL;
            return -1;
        }

        fat_date_t fdate;
        fat_time_t ftime;

        // this time transformation is esentially the reverse of the one in vfs_fat_stat()
        fdate.mday = tm_time.tm_mday;
        fdate.mon = tm_time.tm_mon + 1;     // January in fdate.mon is 1, and 0 in tm_time.tm_mon
        fdate.year = tm_time.tm_year - 80;  // tm_time.tm_year=0 is 1900, tm_time.tm_year=0 is 1980
        ftime.sec = tm_time.tm_sec / 2,     // ftime.sec counts seconds by 2
        ftime.min = tm_time.tm_min;
        ftime.hour = tm_time.tm_hour;

        filinfo_time.fdate = fdate.as_int;
        filinfo_time.ftime = ftime.as_int;
    }

    vfs_fat_ctx_t *fat_ctx = (vfs_fat_ctx_t *) ctx;
    _lock_acquire(&fat_ctx->lock);
    prepend_drive_to_path(fat_ctx, &path, NULL);
    FRESULT res = f_utime(path, &filinfo_time);
    _lock_release(&fat_ctx->lock);

    if (res != FR_OK) {
        LOG_D("%s: fresult=%d", __func__, res);
        errno = fresult_to_errno(res);
        return -1;
    }

    return 0;
}

#endif // CONFIG_VFS_SUPPORT_DIR
